[
  {
    "book_id": "38709",
    "book_name": "Holes",
    "review_rating": 4,
    "review_text": "Read this with my English class in the Marshall Islands. For some this was their first novel ever. Was proud of them for finding 2 errors in the book. They loved it-I enjoyed teaching it.",
    "date": "2017-07-09",
    "entity_type": "review"
  },
  {
    "book_id": "38709",
    "book_name": "Holes",
    "review_rating": 5,
    "review_text": "Holes is an adorable short middle-grade novel. I love children books, especially the ones so well written and with a strong plot like this one. The backstory was fascinating and interwove perfectly with the current days events and I loved the character growth. \n As soon as possible I'll read book 2 in the series. \n Thanks Melanie and Sarah for recommending this one!",
    "date": "2016-03-31",
    "entity_type": "review"
  },
  {
    "book_id": "38709",
    "book_name": "Holes",
    "review_rating": 4,
    "review_text": "loved this book. it was read to me as a child and brought back memories! love the piece of destiny and how the past loops into the future!",
    "date": "2017-06-20",
    "entity_type": "review"
  },
  {
    "book_id": "38709",
    "book_name": "Holes",
    "review_rating": 4,
    "review_text": "Fun book!",
    "date": "2016-05-25",
    "entity_type": "review"
  },
  {
    "book_id": "38709",
    "book_name": "Holes",
    "review_rating": 5,
    "review_text": "WHY did I wait so long to read this?? I blame Shia LaBeouf and a movie I had no desire to see. But, listening to this on audio and pulling together all of the threads of this modern folk tale (at least I feel like that's what it most closely resembles), was delightful.",
    "date": "2016-10-30",
    "entity_type": "review"
  },
  {
    "book_id": "38709",
    "book_name": "Holes",
    "review_rating": 5,
    "review_text": "I read this book for the 2016 Reading Challenge \"A book that takes place during summer\" category. Texas is plenty hot in the summer even when you aren't out there digging holes! \n I heard of this book when I watched the movie Holes (back when Shia LaBeouf was Even Stevens and not...well, Shia LaBeouf). It was a great movie, thanks to the fact that it was a great book! It was a fast and easy read meant for a young adult reader.",
    "date": "2016-01-14",
    "entity_type": "review"
  },
  {
    "book_id": "38709",
    "book_name": "Holes",
    "review_rating": 4,
    "review_text": "Myth, redemption, and lots of digging.",
    "date": "2017-02-25",
    "entity_type": "review"
  },
  {
    "book_id": "38709",
    "book_name": "Holes",
    "review_rating": 4,
    "review_text": "Reading along I kept having to remind myself this was a book for middle-school kids. Things are definitely grim for the boys in the story. And there are so many coincidences that I was distracted. Only when I realized it was a \"tall-tale\" did I appreciate the book. And the conclusion snuck up on me and really gave me a case of the shivers! Very nicely done, I see why it won so many awards.",
    "date": "2016-04-21",
    "entity_type": "review"
  },
  {
    "book_id": "6310",
    "book_name": "Charlie and the Chocolate Factory",
    "review_rating": 5,
    "review_text": "I registered a book at BookCrossing.com! \n http://www.BookCrossing.com/journal/14465636",
    "date": "2017-03-27",
    "entity_type": "review"
  },
  {
    "book_id": "6310",
    "book_name": "Charlie and the Chocolate Factory",
    "review_rating": 4,
    "review_text": "Charlie and the Chocolate Factory might be the best book to movie(tim burton's) adaption ever. Everything about the book is perfect. I really enjoyed the book I can't wait to finish reading it to the kids.",
    "date": "2016-06-26",
    "entity_type": "review"
  },
  {
    "book_id": "6310",
    "book_name": "Charlie and the Chocolate Factory",
    "review_rating": 5,
    "review_text": "I love Roald Dahl. He appeals to a child's sense of justice, although as an adult you look at it and go, \"This is kinda wonky\".",
    "date": "2017-01-03",
    "entity_type": "review"
  },
  {
    "book_id": "6310",
    "book_name": "Charlie and the Chocolate Factory",
    "review_rating": 5,
    "review_text": "The audio book is a must listen. So awesome!",
    "date": "2016-09-13",
    "entity_type": "review"
  },
  {
    "book_id": "6310",
    "book_name": "Charlie and the Chocolate Factory",
    "review_rating": 3,
    "review_text": "Reread. \n Wonderfully weird, but probably my least favourite Roald Dahl. I was trying to settle an argument about which movie adapts best, but each one gets different things right. The difference that I get stuck on is that the oompa loompa poems/songs are SO much meaner in the books :)",
    "date": "2017-07-10",
    "entity_type": "review"
  },
  {
    "book_id": "6310",
    "book_name": "Charlie and the Chocolate Factory",
    "review_rating": 5,
    "review_text": "Still one of my favorites.",
    "date": "2016-10-04",
    "entity_type": "review"
  },
  {
    "book_id": "6310",
    "book_name": "Charlie and the Chocolate Factory",
    "review_rating": 5,
    "review_text": "Fun book. I read it because it was audio - read by Roald Dahl.",
    "date": "2017-06-25",
    "entity_type": "review"
  },
  {
    "book_id": "149267",
    "book_name": "The Stand",
    "review_rating": 5,
    "review_text": "This is a great book and I'd give it 4.5 stars if I could. I would definitely recommend it. It's an interesting blend of science fiction and fantasy. Plague created by man combined with a demonic presence intent on destruction made for a blend of story that hooks you until the end. There's good character development in the story, which makes it a lot more enjoyable to read.",
    "date": "2016-01-11",
    "entity_type": "review"
  },
  {
    "book_id": "149267",
    "book_name": "The Stand",
    "review_rating": 4,
    "review_text": "I read this post-apocalyptic tale a long time ago. For a long time it was perhaps my favourite Stephen King book. I suspect my mistake was reading the unedited, extended version of the book. I recall it seeming like quite a 'door-stopper' for the time. \n The strength's of this book to me were also it's weaknesses. It jumps around between initially unconnected individuals points of view quite a bit if I recall. Some of the stories were hard to put down, others - not so. This made it kind of annoying when you were forced to stop reading a POV you liked because King, suddenly decided to go off and tell a bit of someone else's story for a while. \n The depiction of a post virus apocalypse was intense at times and well thought out. For me the best part of the book was the first three quarters, up until the various groups start converging. The weakest part was the lead up to and the finale, where the Randall Flag chap came into the story. I didn't realise it at the time, but apparently Flag is a recurring character in King's novels, but I'm not sure I've read the other ones he's in. \n I did see the film of this book, and I'd say skip the film - it didn't do the book justice, at least not for me. \n Rating this, I felt torn. It's a long time since I've read it, so I'm going off a slightly hazy memory. What I CAN remember is thinking it was a fantastic book for the most part, but particularly towards the end my enjoyment waned somewhat. I remember thinking most of the traveler characters were awesome, particularly the guy who takes a motorcycle and falls off it. I really like that poignant event, it made you broaden your consideration of what surviving an apocalypse might mean. It made you realise that there challenges of life might extend to simple things you hadn't thought of. If you break your ankle now, sure - it's a bitch. But you get patched up at the hospital and within a year you can probably forget about it. If you were the last man alive and you knew nothing about orthopedic medicine.. Well it would be much more serious. The description of the car tunnel, filled with corpses - that sticks out in my memory too. And the girl who seems immune but is forced to care for and watch her family die around her. This is a dark book at times, but it's all the better for it. \n I kind of wish it hadn't gone into the slightly mystical bit at the end. With the ongoing Randall Flag thing, I can see why maybe it had to, but the best parts of the book are earlier on. \n Part of me says 'Five stars!' but for the little flaws and issues I've mentioned, I feel like that would be a slightly unfair, old 'fanboi' score. I haven't read much King for a long time. I think 4.5 stars is right for this. In places it's the best King I've read I think, but in others places it's a long way from it. \n Martyn Stanley \n Author of:-",
    "date": "2016-03-18",
    "entity_type": "review"
  },
  {
    "book_id": "149267",
    "book_name": "The Stand",
    "review_rating": 4,
    "review_text": "** spoiler alert ** \n M. O. O .N. This spells fantastic! \n I've just finished the book. Overall I loved it, even though it was very long. I enjoyed the characters and the settings, but not the way some of the ending unfolded. Perhaps the last chapter that King added ' the circle closes ' gives more indication of what happened in Vegas to Flagg. It really made no sense when he just disappeared but i think he corrected that. \n King wrote some amazing characters. I think this is what makes the book so enjoyable. Larry in particular changed so much. I did not like him at all when we first met him and then he just changed so much. It was great and unexpected. \n I think this is a book I would read again in a few years. I bought it as a epub but i would get myself a hard copy as well.",
    "date": "2017-02-16",
    "entity_type": "review"
  },
  {
    "book_id": "149267",
    "book_name": "The Stand",
    "review_rating": 3,
    "review_text": "My first foray into Stephen King! \n I can almost taste his characters, they are so fully and complexly developed. I feel like I know some of those characters like I know my life-long friends. It's definitely a character-driven book, not a plot-driven book. \n There's a huge lead up to something epic, but then that event's culmination is treated with 2-4 pages at most. I kept thinking, \"surely that can't be the end of it.\" It's downright anticlimactic. \n Still, would totally read again. Thoroughly enjoyed.",
    "date": "2016-03-10",
    "entity_type": "review"
  },
  {
    "book_id": "149267",
    "book_name": "The Stand",
    "review_rating": 5,
    "review_text": "Haven't read anything by Stephen King since Pet Sematary (long time ago) so don't know for certain that he hasn't topped this, but hard to imagine. Head and shoulders above his other work and a genuinely great American novel.",
    "date": "2016-11-26",
    "entity_type": "review"
  },
  {
    "book_id": "149267",
    "book_name": "The Stand",
    "review_rating": 4,
    "review_text": "An excellent read. The first third of the book I really liked, though I skimmed most villain's POVs (not needed to follow plot, and unpleasant). The middle bit muddles around in politics like an Isaac Asimov's Foundation book, then the end third is mostly our main characters fighting against 'evil.' If this book was by anyone other than Stephen King, the editor would have probably asked the author to cut a third of it. But the book IS by Stephen King, and even a meandering plot is a good read from such a great writer. So. An excellent read.",
    "date": "2016-06-05",
    "entity_type": "review"
  },
  {
    "book_id": "149267",
    "book_name": "The Stand",
    "review_rating": 2,
    "review_text": "** spoiler alert ** \n Maybe it's really 1.5 stars. I read the extended version because that's the one the library had available. To my understanding it's currently the only one in print. according to most people I've talked to is kind of a shame. There are so many things that made this book hard to get through that adding on the extra 400 or so pages just makes it worse. I agree that having the complete voyage of the trash can man is important but the rest of it not so much. Perhaps just adding in those extra bits as bonuses at the end could have been a better solution. If I had read the original maybe I wouldn't have been as taken out of the story so often? If that's the case then I understand why so many people enjoy reading this book. It has a great set up, ultimate good versus evil, an exploration of humanity at it's best and worst. That's why it's so frustrating when ultimately it just doesn't deliver on the promise of the set up. This is one of King's works that suffers from the writer working through his own issues on the page and an editor who couldn't reign him in. Normally King is such a talented story teller I would be happy to go along for any ride with him no matter how long but not this one. \n The only women we get in this book are one dimensional characters that only care about sex, reproduction, and how they relate to the main male characters. We don't know them outside of this. Fran is the only female lead with any depth and in the early chapters she shows great potential. Her relationship with her father is great, her motivation makes sense, she has great promise. After she and Harold leave Maine her personality evaporates and she becomes a walking incubator only there to further spur on Harold and Stu's development. She literally cares about nothing but her baby and her man. If there had been other truly fleshed out female characters this wouldn't be a problem. It is possible to have a character with that be the main motivation. Other female characters are horribly mean mothers (recurring theme for king), women Larry sleeps with who either remind him he's awful or are used to show his transition, the slut (she literally does nothing but creep people out with how sexually aggressive she is), \"magical negro\" saint, and Nadine who is only there to be a vessel for men to put things into. The term \"my/your/his woman\" is tossed about a lot. \n This is a book about straight white men written by a straight white man. The only characters truly developed are straight white christian men. It's never explicitly stated that there aren't other people who survive and live in these towns. There could be a very diverse mix of people on both the good and bad sides, but they aren't mentioned and the only people in power are straight white guys. Yes, Mother Abigail is black. She doesn't really count as a character so much as a symbol without much agency. I like the idea of her but she's basically reduced to a magical negro stereotype. I'm annoyed that the world ends, society collapses, and we immediately choose the same people to lead. Maybe King is right and this is exactly what happens. \n Everyone in this book is Christian or raised Christian and doesn't initially believe. I think King was implying that all things the characters go through is mostly fate that they don't have control over. That may be a truth but it feels kinda lame while reading. Having characters choose to do things because of mystical intervention is fine, but it felt like the characters weren't choosing their paths. They exist and are pushed around on a giant chess board. Which isn't a criticism of the idea but the way it was expressed. \n Where the book shines is in the premise and in the little details that King always brings to his writing. This apocalypse feels so plausible. The reaction of the government feels real. The characters that King does spend time fleshing out feel like real people. Characters like Nick, Tom, Harold, and Trashcan are interesting and compelling. Nick is interesting and compelling, I'd read pages and pages about his travels before the plague. Tom is a mentally challenged man who is treated with kindness and respect with the other people around him. He's a thoughtful character and making his disability some sort of magical God conduit feels unnecessary. Harold is complex and interesting. Everyone knows a guy like Harold and watching him descend into madness is fascinating and heartbreaking. The flaws in those characters humanize them. It's emphasized that the people in Vegas are just people. They don't necessarily flock to the dark man because they are evil. They go because they are scared. He's manipulated and lied to them, creating and us versus them scenario. It's very human. The ending maybe happy but it isn't perfect. People suffer, society starts to rebuild for good or ill. \n Ultimately I feel like if this had been one of kings later works instead of his early works he would have been able to deliver a shorter more nuanced and enjoyable work. Not a bad book just not the book for me.",
    "date": "2017-09-02",
    "entity_type": "review"
  },
  {
    "book_id": "6304335",
    "book_name": "Beautiful Creatures",
    "review_rating": 1,
    "review_text": "I was excited to read this one since I do love these types of paranormals but the male POV sounded feminine. I was excited to sit and listen to it since it was in written in the male POV. At 35%, I got bored. The whole \"mystery\" felt like it was going in circles. \n I may watch the movie. Maybe it will move faster along than the book.",
    "date": "2017-08-31",
    "entity_type": "review"
  },
  {
    "book_id": "6304335",
    "book_name": "Beautiful Creatures",
    "review_rating": 0,
    "review_text": "had some slow moments through out the novel, however still was able to keep me riveted to my seat.",
    "date": "2016-02-20",
    "entity_type": "review"
  },
  {
    "book_id": "6304335",
    "book_name": "Beautiful Creatures",
    "review_rating": 2,
    "review_text": "Ugh, just not getting into it. Cutting my losses.",
    "date": "2016-04-07",
    "entity_type": "review"
  },
  {
    "book_id": "6304335",
    "book_name": "Beautiful Creatures",
    "review_rating": 5,
    "review_text": "I thought this book was awesome :)",
    "date": "2017-06-27",
    "entity_type": "review"
  },
  {
    "book_id": "6304335",
    "book_name": "Beautiful Creatures",
    "review_rating": 4,
    "review_text": "Wow! i'm overwhelmed. This book is amazing. Pertama, karena aq suka nama Ethan. Ethan jg suka baca buku and punya peta dunia yg akan dia tandai setiap dia abis baca buku - it's a good idea by the way - plus dia pemain basket jago. Kedua, untuk yg udh pernah nonton film-nya, aq cuma nonton buntut tp aq berani bilang ini jauh jauh jauh beda dengan film-nya! Ketiga, kurasa ini buku pertama yg aq baca dimana selain unsur magic-nya kental banget, ada unsur hantu-nya pulak. Alur-nya emang terkesan lambat tp justru benar2 menjabarkan bagaimana perasaan Lena dan Ethan terhadap satu sama lain. Dalem banget! Hey, bahkan Edward - Bella ngga bisa membaca pikiran secara dua arah kan? Mereka bener2 dewasa untuk ukuran remaja umur 16thn. Satu2nya kekurangan cuma...ini serial lagi... Aaakh!?!",
    "date": "2016-07-17",
    "entity_type": "review"
  },
  {
    "book_id": "6304335",
    "book_name": "Beautiful Creatures",
    "review_rating": 3,
    "review_text": "Way better than the movie. I bet fans of the book were pissed when that came out. On to the next!",
    "date": "2017-09-01",
    "entity_type": "review"
  },
  {
    "book_id": "6304335",
    "book_name": "Beautiful Creatures",
    "review_rating": 3,
    "review_text": "I mostly like the plot. I like the idea that there are some magical people in the world and that they can either be Light or Dark. The book runs into a major problem where a LOT of YA books have a similar plot - new kid in school, magical abilities, having to choose between (or being chosen by) good and evil, you get the drift. However, these authors pull it together by providing just enough plot twists that made me keep reading. \n My main complaint is that this book is way too long. There are so many central characters in the book, yet we're stuck mainly dialogue between 2 main characters, and a lot of it is teenage whining. I don't even know how many times I wanted to tell the characters to pull up their big kid pants and to get stuff done. The book is almost too stereotypical. Go look at this article by Buzzfeed: http://www.buzzfeed.com/farrahpenn/tu... \n that's literally the book, but for 563 pages. The worst part is that it's one out of 4 books. The series could have easily ended with this book. All they had to do is re-write the last 20 pages, it'd be done. \n But no \n There's 3 more. \n Thanks Garcia and Stohl. Thanks. \n Anyways, it was easy to read and it was interesting enough that I kept reading it, even though it was painfully stereotypical and not...awesome.",
    "date": "2016-01-06",
    "entity_type": "review"
  },
  {
    "book_id": "39988",
    "book_name": "Matilda",
    "review_rating": 5,
    "review_text": "I got the chance to finish Matilda by Roald Dahl on a busy Sunday since all the Filipinos, including my family, were preparing for the New Year's Eve. I was just curling up with it at a bamboo chair in our living room, catatonic to the people bustling around. My absorption and enthrallment in it may have been so deafening to them, or they may have been intrigued by why I made different facial reactions whenever I turned the next pages. Then, it occurred to me that I had an important appointment with my best friend! But it was still past 2 O clock. Relief flooded over me and I kept at it. When it was already 4 O clock , I was on the verge of the last pages, but I was agitated. I really had to go. She must have been waiting for me for minutes on end. I dismissed this guilty feeling, apathetic to whatever comeuppance I might get. Bahala na si Batman! \n When I finished it, I blurted out ,\" I WANNA READ ANOTHER ROALD DAHL's BOOKS!!!\" My younger sister and her friends who happened to have been playing in front of me gawked at me in surprise. I found myself clasping my hands and turning my head up. It was a childish and silly moment. \n Although I have read some Roald Dahl's books, I still was not his big fan. By golly, it has just occurred to me now that the only children book author I look up to and consider as my favorite one is Genaro Gojo Cruz, my countryman writer. Gee! I see. Anyway, I first read Charlie and the Chocolate Factory upon being fascinated by its movie adaptation. I liked the book so much because of the \"psychological character\" of Mr. Wonka played by award -winning Hollywood actor Johny Depp. Thereafter, I wanted another one. However, I was disappointed when I read Charlie and the Glass Elevator because of its only-elementary-students-would-appreciate impact. After all, I was anything but childish. Nevertheless, I still hung in there. I read and enjoyed Boy: Tales of Childhood . It's not a fantasy, but a memoir of his childhood. The laconic account of his miserable but mischievous childhood's education drove me nuts, reminding me of Frank McCourt's Angela's Ashes. However, I was not falling in love with Dahl yet. In fact, I gave one of his short story The Landlady a very low rating . I was no longer interested in his other stories given that I had planned to have Roald-Dahl-stories marathon, except my hidden desire for Matilda and The BFG. As you know, I could not afford such books yet. \n In light of Matilda, I now consider Roald Dahl as one of my favorite children books writers. I enjoyed it a whole a lot. First, I loved her character as a precocious child. I am pretty sure that even book worms out there would be exhilarated by her early interest in reading books, especially that she even read the adults ones which are supposed to be heavy for a young reader whose IQ is still underdeveloped. Thus, I am ashamed to say that I did not read the books such as The Secret Garden, Great Expectations, Nicholas Nickleby, Oliver Twist, Jane Eyre, Pride and Prejudice, Tess of the d'Urbervilles, Gone to Earth, Kim, The Invisible Man, The Old Man and the Sea, The Sound and the Fury, The Grapes of Wrath, The Good Companions, Brighton Rock, Animal Farm, Moby Dick, Ivanhoe, The Red Pony and Peter and Wendy. \n The most exciting part about the book is Matilda's tricks. Since she is a brilliant child, I can't wait to know the next situation on how she will play tricks on her apathetic dad, on how she will engage in an argument with Mrs. Trunchball, and on how she will help Ms. Jenny to get her house and money back by scaring the living daylights out of her. It is a whodunit scene. \n The book is worth reading because it is replete with moral lessons. For instance, Matilda embodies intellectual humility granted that she is still innocent. It is our perception that a gifted child is supposed to have la di da attitude. \n One of the things I have observed since I read Roald Dahl's books is that most of his stories' theme is about parents' negligence and wrong educational system. In Charlie and the Chocolate Factory, Mr. Wonka psychologically paints a picture of being an orphan, his hidden desire to get a paternal attention. In Boy: The Tales of Childhood, Dahl recollects his school life when he went through his teachers' ill-treatment. In Matilda, her parents are not responsible for their kids, depicted as apathetic and lazy parents. They are not even aware of Matilda's brilliance mind. Furthermore, they don't teach them good values. Rather, they inculcate their kids in the essence of business competition. Matilda's father is a crooked businessman whereas her mother prefers pulchritude to intelligence. Fortunately, despite her young age, Matilda is smart and mature enough to understand what is good or bad. Also, she is sensible and sensitive to the people around her. On the other hand, the book describes the rotten education system represented by Ms. Trunchball. In this case, Roald Dahl appears to have used the same rhetoric patterns. It seems that he deeply drew most of his stories from poverty, some kind of Charles Dickens style. \n Supposedly, Matilda was part of my reading class with my Korean student. My student was so generous to fault that she bought me my own copy. In fact, we came to terms that I should not read it on weekends,except in our class. However, I could not hold back the temptation. (laughs) Whoa! I still have this tinge of Roald-Dahlic excitement. (laughs)",
    "date": "2017-01-20",
    "entity_type": "review"
  },
  {
    "book_id": "39988",
    "book_name": "Matilda",
    "review_rating": 4,
    "review_text": "Love it ! Just how I pictured it would be.",
    "date": "2016-04-16",
    "entity_type": "review"
  },
  {
    "book_id": "39988",
    "book_name": "Matilda",
    "review_rating": 5,
    "review_text": "Love this girl! I want to sit with hot cocoa and read for hours a day, and be a bold fighter for goodness like she is. Fun! A favorite author of mine.",
    "date": "2016-03-24",
    "entity_type": "review"
  },
  {
    "book_id": "39988",
    "book_name": "Matilda",
    "review_rating": 5,
    "review_text": "Reread to be all set to see the show!",
    "date": "2017-03-23",
    "entity_type": "review"
  },
  {
    "book_id": "39988",
    "book_name": "Matilda",
    "review_rating": 3,
    "review_text": "We chose this book because we loved Charlie and the Chocolate Factory. My kids loved Matilda. I wasn't that impressed. I was surprised by how much hatred and evil was in the book. The parents are awful to Matilda. Mrs. Trunchbull is awful. For the most part, it was depressing! You got little rays of hope when Matilda would stand up for herself (and at the end), but those were just little highlights here and there.",
    "date": "2017-01-01",
    "entity_type": "review"
  },
  {
    "book_id": "39988",
    "book_name": "Matilda",
    "review_rating": 3,
    "review_text": "This book is full of problems, hence losing stars, but my inner child and remembers me of the movie makes up for it. \n I felt the book has no punishment to those that abuse children, the way characters talked to or about female characters left much to be desired. \n The artwork scattered throughout the book was cute, the story was cute, Matilda and Miss Honey had a sweet friendship. \n Overall, it wasn't too bad, just not my favourite.",
    "date": "2017-02-06",
    "entity_type": "review"
  },
  {
    "book_id": "39988",
    "book_name": "Matilda",
    "review_rating": 4,
    "review_text": "it's a good story and really funny at times... i just don't think a child should read this without the guidance of their parents.",
    "date": "2017-08-06",
    "entity_type": "review"
  },
  {
    "book_id": "39988",
    "book_name": "Matilda",
    "review_rating": 5,
    "review_text": "One of the best things about being an adult is that I can buy all of the books I want. Okay, maybe not all of the books because there would just not be room for my family and I if I bought ALL OF THE BOOKS but I can buy my favorites from the different seasons of my life. Growing up, I was lucky enough that my dad would take me to the library whenever I wanted. One of the books that I checked out countless times was Matilda by one of my favorite authors, Roald Dahl. \n If you're a book lover, this book will resonate with you, even if you are an adult. Matilda is a book lovers' character. She breathes books. She believes in the power of books to change her life and they definitely do. I loved her as a child for many of the same reasons that I love her now. She is secure in her own power even with her family constantly telling her that she's worthless because she speaks her mind and is interested in more than just \"watching the telly.\" She isn't afraid to be different and she believes in herself. She's a great, strong character and one that has stood the test of time. \n Roald Dahl is still one of my favorite authors. His books, including Matilda, are incredibly inventive and entertaining. I love how vivid his characters are. He knows how to write in such a way to get kids to want to read and to be interested in what is happening to the characters throughout the book. Not only is our main character, Matilda, amazing but it's hard to forget secondary characters like Miss Honey and The Trunchbull. This was such a fun re-read for me!",
    "date": "2016-11-05",
    "entity_type": "review"
  },
  {
    "book_id": "472331",
    "book_name": "Watchmen",
    "review_rating": 5,
    "review_text": "A reread. I finally ordered a copy for my school library and have been pushing it pretty hard, so I figured it wouldn't hurt to remember the details a bit more sharply. Once again, 'twas perfect.",
    "date": "2016-01-22",
    "entity_type": "review"
  },
  {
    "book_id": "472331",
    "book_name": "Watchmen",
    "review_rating": 4,
    "review_text": "Like a multi-genre graphic novel. A fantastic take on what would happen if people really dressed up and took on the role of superheroes in our society.",
    "date": "2017-06-07",
    "entity_type": "review"
  },
  {
    "book_id": "472331",
    "book_name": "Watchmen",
    "review_rating": 5,
    "review_text": "One of the coolest books I've ever had to read for school. I'm actually glad my first time reading it was for a class because there is so much in this story that I wouldn't have noticed otherwise had we not unpacked nearly everything there was to analyze. Also I was a huge fan of the frequent visual to word puns.",
    "date": "2016-03-03",
    "entity_type": "review"
  },
  {
    "book_id": "472331",
    "book_name": "Watchmen",
    "review_rating": 5,
    "review_text": "Second time through. I am a much better reader than my high school self who first read this and it resonated with me a whole lot more this time. Holy shit this book has layers.",
    "date": "2016-11-03",
    "entity_type": "review"
  },
  {
    "book_id": "472331",
    "book_name": "Watchmen",
    "review_rating": 4,
    "review_text": "Having loved the film when it was released, I decided to revisit this in its original form. It's easy to see why it is hallowed in the medium. Multi-layered and big messages, this seemed to have flipped the superhero story on its head. It aged fairly well too. Definitely worth reading once.",
    "date": "2016-04-27",
    "entity_type": "review"
  },
  {
    "book_id": "472331",
    "book_name": "Watchmen",
    "review_rating": 4,
    "review_text": "Reads like a short novel. Kind of better than the movie. Good deconstruction",
    "date": "2016-03-21",
    "entity_type": "review"
  },
  {
    "book_id": "472331",
    "book_name": "Watchmen",
    "review_rating": 5,
    "review_text": "I will never get over this utopia of a graphic novel. A remarkable tale about the wretchedness of humankind and grotesque death, but most of all, this bursting miasma we call life.",
    "date": "2017-04-08",
    "entity_type": "review"
  },
  {
    "book_id": "2728527",
    "book_name": "The Guernsey Literary and Potato Peel Pie Society",
    "review_rating": 5,
    "review_text": "This took almost 50 pages for me to understand the format and keep the characters straight. But, it was SO worth it! I enjoyed the characters and the story line immensely.",
    "date": "2017-01-08",
    "entity_type": "review"
  },
  {
    "book_id": "2728527",
    "book_name": "The Guernsey Literary and Potato Peel Pie Society",
    "review_rating": 4,
    "review_text": "While initially difficult to find the rhythm of this story-in-letters, THE GUERNSEY LITERARY AND POTATO PEEL PIE SOCIETY ultimately proves an artistically energizing novel filled with eccentric yet amicable characters and a free-spirited, deeply affectionate protagonist.",
    "date": "2016-07-06",
    "entity_type": "review"
  },
  {
    "book_id": "2728527",
    "book_name": "The Guernsey Literary and Potato Peel Pie Society",
    "review_rating": 4,
    "review_text": "Books written in the epistolary style are among my least favorite genres. Yet, I really enjoyed this book! I liked how well I got to know the characters and found myself thinking about them when I wasn't reading, and rooting for one character while booing another. I wanted to know them personally, and be part of their circle. It was one of the more immersive books I have read in a long time. It also offered some WWII history that I didn't know about - the German occupation of the Channel Islands of Great Britain. The theme of books/reading/literature and its effect on a reader that is threaded throughout the book appealed to me as an avid page-turner and one who has also enjoyed the comraderie of a book club and connections made in the sharing of good books. The only thing that kept it from being a 5 star book, for me, was the fairly common use of taking the name of deity in vain.",
    "date": "2017-09-12",
    "entity_type": "review"
  },
  {
    "book_id": "2728527",
    "book_name": "The Guernsey Literary and Potato Peel Pie Society",
    "review_rating": 5,
    "review_text": "This book took a bit for me to get snagged. I don't usually read books in letter format. But this one had me intrigued, I must say. It was funny and sweet and oddly comforting. Despite the subject matter, I felt like I was reading Anne of Green Gables. \n I loved it, readers! It's so fantastic!",
    "date": "2017-08-15",
    "entity_type": "review"
  },
  {
    "book_id": "2728527",
    "book_name": "The Guernsey Literary and Potato Peel Pie Society",
    "review_rating": 0,
    "review_text": "Always delightful. Even the fourth (or was it fifth) time through.",
    "date": "2016-03-02",
    "entity_type": "review"
  },
  {
    "book_id": "2728527",
    "book_name": "The Guernsey Literary and Potato Peel Pie Society",
    "review_rating": 4,
    "review_text": "3 1/2 stars \n This was our Book Club read for the month. There were a lot of things I did enjoy, but not enough to feel like I can rave about the book. \n I enjoyed the founding of the Literary Society, the mutual love of books, the quirky characters, the clever way letters still continued to flow once Juliette reached Guernsey, and the fact that it was easy to imagine living in Guernsey during the time period. \n I didn't enjoy what felt like too many characters (it was so hard to initially keep people straight), or the way the ending felt rushed. Still, it was a nice change of pace from what's felt like really depressing/heavy books I've been reading lately...so I'll round up to 4 stars!",
    "date": "2016-04-09",
    "entity_type": "review"
  },
  {
    "book_id": "2728527",
    "book_name": "The Guernsey Literary and Potato Peel Pie Society",
    "review_rating": 4,
    "review_text": "Sweet. But not fluff. Some heartbreak.",
    "date": "2016-05-18",
    "entity_type": "review"
  },
  {
    "book_id": "2728527",
    "book_name": "The Guernsey Literary and Potato Peel Pie Society",
    "review_rating": 5,
    "review_text": "So good and so different! Thanks to Abbi for recommending it!",
    "date": "2016-01-03",
    "entity_type": "review"
  },
  {
    "book_id": "24213",
    "book_name": "Alice's Adventures in Wonderland",
    "review_rating": 4,
    "review_text": "Serial petualangan Alice merupakan kisah fairy tales, penuh fantasi. Iya. Tetapi, permainan kata-kata yang dilakukan oleh Lewis Carroll banyak yang berbentuk sarkasme (untuk edisi asli bahasa Inggris, tidak begitu terlihat di dalam terjemahan). Isu-isu yang diparodikan oleh Lewis Carroll merupakan komedi satir yang sangat menyindir dunia politik saat itu. Anak-anak akan melihat itu sebagai sebuah bentuk komedi biasa, sementara orang dewasa akan melihatnya sebagai lelucon politik yang dikemas ke dalam cerita yang tidak masuk akal. \n Kisah petualangan Alice diperuntukkan bagi semua kalangan. Unsur fantasi yang ada di dalamnya tidak berdiri secara mutlak. Maksudnya, pada setiap akhir kisah petualangan Alice -- baik ketika dia berada di Negeri Ajaib maupun di dalam Rumah Cermin -- kita sebagai pembaca diajak kembali ke dunia nyata. Petualangan-petualangan yang dialami Alice sebelumnya, dianggap sebagai sebuah mimpi. Bagi saya, hal seperti ini membuat kita (termasuk anak-anak yang membaca kisah petualangan Alice) tetap diajak untuk berpikir realistis; se-seru dan se-hebat apapun petualangan fantasi yang dialami di dunia mimpi, tetap tidak merubah apapun yang terjadi di kehidupan nyata.",
    "date": "2016-10-22",
    "entity_type": "review"
  },
  {
    "book_id": "24213",
    "book_name": "Alice's Adventures in Wonderland",
    "review_rating": 2,
    "review_text": "#12 Best Sellers of all time, estimated 100 million copies sold (source: Wikipedia.org) \n I'm just not a fan of Carroll's juxtaposed, illogical, keep the reader in a state of confusion, oh! it's all a dream, style. My copy has both these books bound together, and while I don't like either, \"Alice's Adventures in Wonderland\" is less unsatisfactory than \"Through the Looking Glass.\" \n However, after seeing this staged a couple of times, I can understand why people who like word play for it's own sake, gorgeous costumes and vivid settings, adore this book. I can enjoy it on the stage, but I merely tolerate it in print. \n I do own it, but would prefer not to, so this is a title I'll be happy to sell after I've fulfilled my home school duty - and maybe even before. \n Want to read #11 best seller of all time? See \n Dream of the Red Chamber, Cao Xueqin, 1791",
    "date": "2016-05-15",
    "entity_type": "review"
  },
  {
    "book_id": "24213",
    "book_name": "Alice's Adventures in Wonderland",
    "review_rating": 5,
    "review_text": "Strange and marvelous.",
    "date": "2017-01-12",
    "entity_type": "review"
  },
  {
    "book_id": "24213",
    "book_name": "Alice's Adventures in Wonderland",
    "review_rating": 5,
    "review_text": "This is not a children's book in reality.",
    "date": "2017-02-01",
    "entity_type": "review"
  },
  {
    "book_id": "24213",
    "book_name": "Alice's Adventures in Wonderland",
    "review_rating": 5,
    "review_text": "A story that began as a way to amuse three young girls on a summer's day still stands as a classic today. One of the many books that most of us think we know, even if we've never gotten around to reading it. To finally put it on my lifetime read list feels very good. Even better is how well the story holds up over a century after its publishing. There's a wonderful, funny story for the children, layered with subtle points for the adults. Dodgson/Carroll carefully wove a wide variety of experiences and questions into the story of a little girl looking for something to do on a boring summer day. \n A truly delightful trip into the world on the other side of the mirror.",
    "date": "2017-01-20",
    "entity_type": "review"
  },
  {
    "book_id": "24213",
    "book_name": "Alice's Adventures in Wonderland",
    "review_rating": 5,
    "review_text": "Oh! The joy of reading Carroll. The beauty and strangeness of his imagination never fades.",
    "date": "2016-04-13",
    "entity_type": "review"
  },
  {
    "book_id": "24213",
    "book_name": "Alice's Adventures in Wonderland",
    "review_rating": 3,
    "review_text": "Not my cup of tea. Wasn't when I was 8, isn't now.",
    "date": "2016-10-17",
    "entity_type": "review"
  },
  {
    "book_id": "24213",
    "book_name": "Alice's Adventures in Wonderland",
    "review_rating": 5,
    "review_text": "This truly is a book about a child having hallucinations after ingesting some chemicals. All the hints are in the text.",
    "date": "2017-08-10",
    "entity_type": "review"
  },
  {
    "book_id": "9712",
    "book_name": "El amor en los tiempos del cólera",
    "review_rating": 2,
    "review_text": "First I tried to read the book in Spanish in Colombia. I thought it would help me understand the country's most famous author and their past once. I couldn't do it; to be honest, it was just made me fall asleep every time I tried to read. I switched English and I spent almost a month trying to get through this book. It's not a love story. It's a painful story and one that is so antiquated that it couldn't really speak to me in any way.",
    "date": "2017-08-30",
    "entity_type": "review"
  },
  {
    "book_id": "9712",
    "book_name": "El amor en los tiempos del cólera",
    "review_rating": 5,
    "review_text": "This is a magical, beautiful, wonderful joy of a novel. Marquez's enchanting prose floats you through a story that has stayed with me for years.",
    "date": "2016-10-18",
    "entity_type": "review"
  },
  {
    "book_id": "9712",
    "book_name": "El amor en los tiempos del cólera",
    "review_rating": 4,
    "review_text": "Love in the Time of Cholera by Gabriel Garcia Marquez. \n This book was interesting to me, on one hand I had thought it quite superficial in its story about love. A long convoluted life of pining love reciprocated by nothing. On the other hand I knew it had to mean a little more than just that. \n Marquez himself said in an interview, \"you have to be careful not to fall into my trap.\" So here I am trying to understand the trap which I may have so seemingly fallen into. \n Starting off the novel spans a life time between Fermina Daza and Florentino Ariza. With various other character thrown into the mix. I won't go into the summary since there's never enough space for all of that. \n The main theme at least to me resonated in the focus on love as something unhealthy. Like the plague of cholera we see ravaging the landscape, love too ravages ones existence. \n Ariza embodies the unhealthy love of passion and obsession, Daza embodies a life without love, lost and unhappy through time. \n Ariza has various encounters throughout the book as a promiscuous scoundrel edged on by obsession and passion. You are constantly drawn into his life, rooting for him without fully realising how much of a 'bad' guy he really is. He spends his life exploring fetishes after fetishes, love, passion, criminal passion, and personal obsession. Whereas in contrast Dr.Urbino (Daza's husband) embodies stability, normality, and due to an almost loveless marriage (yet learned) leaves Daza unhappy and unfulfilled. \n All this contrasts with the idea that love is a plague to the heart as cholera is to the body. \n The end to me was the most concrete in displaying the literal sense of love in the time of cholera. Ariza and Daza, had finally in old age, for 11 days had the time to actually be together. However here we see how Ariza abuses his power to keep the farce going by extending the trip under the false pretence that there is cholera aboard the ship they're sailing on. Truely a love in the time of cholera. \n Yet still an illusion torn apart by reality which would ruin the love they waited 5 decades for. \n However there is so much to say in a proper analysis of the book, of all the characters and events",
    "date": "2017-02-08",
    "entity_type": "review"
  },
  {
    "book_id": "9712",
    "book_name": "El amor en los tiempos del cólera",
    "review_rating": 5,
    "review_text": "Rating: 4.5 \n Accomplished in every way, but I can't say I'm over the moon about it.",
    "date": "2017-01-24",
    "entity_type": "review"
  },
  {
    "book_id": "9712",
    "book_name": "El amor en los tiempos del cólera",
    "review_rating": 1,
    "review_text": "I have had One Hundred Years of Solitude on my to-read list for a long time. Supposedly it's a \"classic\" every person should read. So, when this book, by the same author, came up as an available \"read-alike\" on my Overdrive account (I'm on the waiting list for 100 Years), I decided to give it a try. I finished it only because I had no other book on audio and I have a long commute. \n Yawn! I will not be reading 100 Years, I don't think I'll ever read another book by this author. I found this one to be unnecessarily graphic and misogynistic and, frankly, boring. I did not like the characters, nor find them remotely believable. Not recommended.",
    "date": "2017-01-07",
    "entity_type": "review"
  },
  {
    "book_id": "9712",
    "book_name": "El amor en los tiempos del cólera",
    "review_rating": 3,
    "review_text": "The writing was so intense and vivid and comical there's no way I could give this less than three stars. The person of Fermina Daza was the most intriguing of all the book to me. But about halfway through, I just lost all interest in the story, and the descriptive prose with its Caribbean sweat and mandible insects and feverish choleric symptoms simply invoked fantasies of a hot bath and an IV drip.",
    "date": "2016-05-21",
    "entity_type": "review"
  },
  {
    "book_id": "12873",
    "book_name": "Rebecca",
    "review_rating": 2,
    "review_text": "2.5 \n I really like Jane Eyre; however, the anonymous heroine in Rebecca could not win my sympathies. \n Daphne du Maurier certainly knows how to create atmosphere. One can float through this book. However, the characters never quite come to life for me: the young woman with the exotic name we never get to learn does not seem to possess any characteristics beyond being shy and self-conscious. She is so pale and insignificant that (so it appears) it was not even necessary to name her. \n Moreover, I guessed the whole plot of the novel before I had read through half of it. \n Jane Eyre certainly is over-romanticised and its dialogues could use much polishing, but when I compare the original from 1847 to its copy from 1938, I have a clear favourite.",
    "date": "2016-05-22",
    "entity_type": "review"
  },
  {
    "book_id": "12873",
    "book_name": "Rebecca",
    "review_rating": 5,
    "review_text": "This was my first time reading this, and I loved it! So dark and brooding, so atmospheric (Manderley the house is a character on its own). Du Maurier does an amazing job setting the scene, and you feel this deep unease even though you can't put your finger on exactly why. It was actually a little different than what I remembered from having seen part of the movie. The book doesn't start at Manderley, it starts farther back and it takes awhile before you even get to the house or start to hear more about Rebecca. It's not fast-paced, but it builds slowly. And of course the writing is wonderful.",
    "date": "2016-10-31",
    "entity_type": "review"
  },
  {
    "book_id": "12873",
    "book_name": "Rebecca",
    "review_rating": 5,
    "review_text": "Absolutely loved this book and couldn't wait to pick it up every day after lectures and studying. I can't even describe my feelings of it... It played with the elements of Jane Eyre brilliantly and I really loved how it seemed the narrator didn't have personality at all at first but you started seeing the glimpses of her through her dreams and daydreams. Now I am going to try not to start rereading the book right after finishing it and read some analysis of it. Good plan.",
    "date": "2016-07-27",
    "entity_type": "review"
  },
  {
    "book_id": "12873",
    "book_name": "Rebecca",
    "review_rating": 4,
    "review_text": "Thrilling tale of the killing of two wives, one physically and the other through conformism. \n Rebecca the wild child, the rebel, sexual deviant, the villain we all hate juxtapose by the new Mrs de Winter with her insufferable submissiveness and constant day dreaming driving the annoyance barometer over to the red, and finally topping off with the devilish Mrs Danvers. \n The setting in Rebecca makes me want to have tea under the chestnut tree and watch the drama play out. \n Wonderful!",
    "date": "2016-07-20",
    "entity_type": "review"
  },
  {
    "book_id": "12873",
    "book_name": "Rebecca",
    "review_rating": 5,
    "review_text": "khwshbkhty chyzy nyst khh btwn br an qymt gdhsht, blkhh ykh khyfyt dhhny w wjwdy st. SfHh 16",
    "date": "2016-05-04",
    "entity_type": "review"
  },
  {
    "book_id": "12873",
    "book_name": "Rebecca",
    "review_rating": 3,
    "review_text": "Many of the books I read tend to be average. I neither strongly dislike them or strongly love them. I've rated most of the books that I have read as being average. They're not exactly bad, but they're also nothing special. For me, Rebecca falls in that boundary. I didn't feel an immense keenness when reading it, although I was very much gripped at certain times. \n The story follows a heroine who meets a man named Max de winter, a widower who proposes to her. She accepts the proposal and moves to the gloomy Manderley, where she is hunted by the memory of his dead wife. \n I loved the mystery, the relatable heroine, and the beautiful prose. Yet I still found the book to be second-rate for a piece of literature. I've read that critics considered Daphne as a \"second rank romantic novelist\" back in the day, but now she is seen more positively. She is nearly even considered a literary genius. However, to me, the book almost feels like the 1930's version of the girl on the train except it's better written. \n Moreover, the pacing is very skewed. The book seems to speed along at specific points, and then it halts and returns to being slightly tedious with the narrator describing or doing mundane things. I am aware that the book is inspired by Jane Eyre, but I haven't read Jane Eyre (shameful!), so I can't make any assessment of its literary value in comparison to it. \n By the way, as I was reading, I kept thinking that I must be missing or overlooking the heroine's name. I thought that there must be something wrong with my memory. I didn't realize until a while that's just never mentioned.",
    "date": "2016-12-07",
    "entity_type": "review"
  },
  {
    "book_id": "12873",
    "book_name": "Rebecca",
    "review_rating": 4,
    "review_text": "This started off slow but then got SO GOOD! It was different than I expected so in that way I went in blind which I think made it even better.",
    "date": "2016-11-25",
    "entity_type": "review"
  },
  {
    "book_id": "12873",
    "book_name": "Rebecca",
    "review_rating": 5,
    "review_text": "4.5 only because I didn't love the ending. This was a gripping read, loved the plot, the pacing, the characters, and all of the twists in the story, but I was just too disappointed by the ending.",
    "date": "2017-08-04",
    "entity_type": "review"
  }
]
